AlertEvidence
| where Timestamp >= ago(7d) and isnotempty(SHA256) and isnotempty(ThreatFamily)
| project 
    SHA256, 
    FileName, 
    IntroductionMethod, 
    SenderFromAddress, 
    RecipientEmailAddress, 
    Timestamp, 
    ThreatFamily, 
    Severity
| summarize 
    FileName = max(FileName), 
    IntroductionMethod = max(IntroductionMethod), 
    SenderFromAddress = max(SenderFromAddress), 
    RecipientEmailAddress = max(RecipientEmailAddress), 
    Timestamp = max(Timestamp), 
    ThreatFamily = max(ThreatFamily), 
    Severity = max(Severity), 
    Count = count() 
by SHA256
| order by Count desc
| project 
    SHA256, 
    FileName, 
    IntroductionMethod, 
    SenderFromAddress, 
    RecipientEmailAddress, 
    Timestamp, 
    ThreatFamily, 
    Severity, 
    Count;
